# Taps
tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "minacle/chntpw"
tap "sidneys/homebrew"

# Binaries
brew "llvm"
brew "mas"
brew "mint"
brew "qemu"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-modern-cg433n-icon"]
brew "sidneys/homebrew/openssl@1.0"

# Zsh
brew "zsh"
brew "autojump"

# Development
brew "yarn"
brew "sqlite"
brew "node"
brew "go"
brew "gopls"
brew "cmake"
brew "python@3.9"

# Tmux packages
brew "tmux"
brew "reattach-to-user-namespace"

# Tools
brew "cabextract"
brew "cdrtools"
brew "neofetch"
brew "you-get"
brew "ripgrep"
brew "tidy-html5"
brew "fd"
brew "hugo"
brew "jq"

# Casks
cask "1password"
cask "1password-cli"
cask "affinity-photo"
cask "aldente"
cask "alfred"
cask "appcleaner"
cask "background-music"
cask "bartender"
cask "basictex"
cask "betterdisplay"
cask "charles"
cask "cmake"
cask "coconutbattery"
cask "dash"
cask "dbngin"
cask "dingtalk"
cask "discord"
cask "docker"
cask "dropbox"
cask "eudic"
cask "exifcleaner"
cask "google-chrome"
cask "google-chrome-canary"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "keycastr"
cask "maczip"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "motrix"
cask "mosaic"
cask "notion"
cask "numi"
cask "obs"
cask "obsidian"
cask "omnifocus"
cask "picgo"
cask "proxyman"
cask "qlmarkdown"
cask "quicklook-json"
cask "skim"
cask "snipaste"
cask "spotify"
cask "surge"
cask "swiftformat-for-xcode"
cask "telegram"
cask "textmate"
cask "transmission-remote-gui"
cask "transmit"
cask "visual-studio-code"
cask "wechat"
cask "wireshark"
cask "xcodes"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "font-source-han-noto-cjk"
cask "font-source-han-mono"
cask "font-source-han-sans"
cask "font-source-han-serif" 
cask "font-source-sans-pro"
cask "font-source-serif-pro" 
cask "font-source-serif"

# App Store
mas "AdGuard for Safari", id: 1440147259
mas "1Password for Safari", id: 1569813296
mas 'Spark', id: 1176895641
mas 'Reeder 5', id: 1529448980
mas 'DevCleaner for Xcode', id: 1388020431