tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "cloudflare/cloudflare"
tap "d12frosted/emacs-plus"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "minacle/chntpw"
tap "sidneys/homebrew"
brew "sqlite"
brew "autojump"
brew "cabextract"
brew "python@3.9"
brew "cdrtools"
brew "cmake", link: false
brew "curl"
brew "fd"
brew "fnm"
brew "git"
brew "go"
brew "gopls"
brew "hugo"
brew "jq"
brew "llvm"
brew "mas"
brew "mint"
brew "neofetch"
brew "neovim"
brew "node"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tidy-html5"
brew "tmux"
brew "wimlib"
brew "yarn"
brew "you-get"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-imagemagick", "with-modern-cg433n-icon"]
brew "minacle/chntpw/chntpw"
brew "sidneys/homebrew/openssl@1.0"
cask "1password"
cask "1password-cli"
cask "affinity-photo"
cask "aldente"
cask "alfred"
cask "appcleaner"
cask "background-music"
cask "basictex"
cask "betterdisplay"
cask "charles"
cask "cmake"
cask "coconutbattery"
cask "dash"
cask "dingtalk"
cask "discord"
cask "docker"
cask "dropbox"
cask "eudic"
cask "exifcleaner"
cask "font-fira-code"
cask "google-chrome"
cask "google-chrome-canary"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "kap"
cask "keycastr"
cask "maczip"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "motrix"
cask "notion"
cask "numi"
cask "obs"
cask "obsidian"
cask "omnifocus"
cask "picgo"
cask "proxyman"
cask "skim"
cask "snipaste"
cask "spotify"
cask "surge"
cask "swiftformat-for-xcode"
cask "telegram"
cask "transmission-remote-gui"
cask "visual-studio-code"
cask "wechat"
cask "wireshark"
cask "xcodes"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "DevCleaner", id: 1388020431
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1529448980
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
